Revit 2027 API
FamilyElementVisibility.VisibilityType Property
Indicates if the instance is Model or View specific.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyElementVisibilityType VisibilityType { get; }
Public ReadOnly Property VisibilityType As FamilyElementVisibilityType
	Get
public:
property FamilyElementVisibilityType VisibilityType {
	FamilyElementVisibilityType get ();
}
member VisibilityType : FamilyElementVisibilityType with get
Property Value
FamilyElementVisibilityType
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace